---
kind: property
id: P:Autodesk.Revit.DB.TriangleInShellComponent.VertexIndex0
source: html/c1317acd-f865-cf47-563e-e54a702bdaa6.htm
---
# Autodesk.Revit.DB.TriangleInShellComponent.VertexIndex0 Property

Index of the triangle's first vertex in the TriangulatedShellComponent's array of vertices.

## Syntax (C#)
```csharp
public int VertexIndex0 { get; }
```